---
kind: method
id: M:Autodesk.Revit.DB.FailureMessageKey.Equals(System.Object)
source: html/d099aa78-971f-2302-d3fe-6cf34c3b3ccf.htm
---
# Autodesk.Revit.DB.FailureMessageKey.Equals Method

Determines whether the specified Object is equal to the current Object .

## Syntax (C#)
```csharp
public override bool Equals(
	Object obj
)
```

## Parameters
- **obj** (`System.Object`) - Another object.